app/Controllers/Urgtec.php

SELECT *
FROM `departamento`
---
                "alertInfo" => $this->session->getFlashdata("alertInfo"),
                "erros" =>     $this->session->getFlashdata("erros"),
                "alert" =>     $this->session->getFlashdata("alert"),
                "departamento" => $departamento->find(),

SELECT *
FROM `departamento`
---
        public function CadastrarDepartamento(){

            $departamento = new \App\Models\DepartamentoModel();

            if($this->request->getMethod() === "post"):
                $departamento->set("nome_departamento", $this->request->getPost("nome_departamento"));
                  if($departamento->insert()):
                        $nome_departamento = $this->request->getPost("nome_departamento");
                                // definindo variváveis temporarias de sessão
                             $this->session->setFlashdata("msg", "Novo Departamento de ${nome_departamento} adicionado com sucesso!");
                             $this->session->setFlashdata("alertInfo", "alert alert-success");
                             $this->session->setFlashdata("alert", "success");

                            return redirect()->to(base_url("cadastrar-departamento"));
                    else:
                             $this->session->setFlashdata("msg", "Não foi possível adicionar este departamento...");
                             $this->session->setFlashdata("alertInfo", "alert alert-danger");
                             $this->session->setFlashdata("erros", $departamento->errors());
                             $this->session->setFlashdata("alert", "danger");
                             return redirect()->to(base_url("cadastrar-departamento"));

                    endif;
            endif;


            $data = [
                "msg" =>       $this->session->getFlashdata("msg"),
                "alertInfo" => $this->session->getFlashdata("alertInfo"),
                "erros" =>     $this->session->getFlashdata("erros"),
                "alert" =>     $this->session->getFlashdata("alert"),
                "departamento" => $departamento->find(),
                "titulo" => "Adicionar Departamento",
                "view" => "cadastroDepartamento"
            ];

SELECT *
FROM `funcionario`
SELECT *
FROM `departamento`
---
            public function listaFuncionarios(){
                    $funcionario = new \App\Models\FuncionarioModel();
                    $departamento = new \App\Models\DepartamentoModel();
                    $data["msg"] = $this->session->getFlashdata("msg");
                    $data["alertInfo"] = $this->session->getFlashdata("alertInfo");
                    $data["alert"] = $this->session->getFlashdata("success");
                    $data["titulo"] =  "Lista de Funcionários Registrados";
                    $data["view"] = "listaFuncionarios";
                    $data["listaFuncionarios"] = $funcionario->find();
                    $data["departamentos"] = $departamento->find();

SELECT *
FROM `departamento`
---
        public function listaDepartamento(){
                    $data["msg"] = $this->session->getFlashdata("msg");
                    $data["alertInfo"] = $this->session->getFlashdata("alertInfo");
                    $data["alert"] = $this->session->getFlashdata("success");
                    $departamento = new \App\Models\DepartamentoModel();
                    $data["titulo"] =  "Lista de Departamentos Registrados";
                    $data["view"] = "listaDepartamento";
                    $data["departamentos"] = $departamento->find();

SELECT *
FROM `departamento`
WHERE `departamento`.`id_departamento` = '25'
---
        public function departamento($id_departamento){

                    if($id_departamento === "finalizar"){

                    }


                    $data["msg"] = $this->session->getFlashdata("msg");
                    $data["alertInfo"] = $this->session->getFlashdata("alertInfo");
                    $data["alert"] = $this->session->getFlashdata("success");
                    $data["erros"] = $this->session->getFlashdata("erros");
                    $departamento = new \App\Models\DepartamentoModel();
                    $data["titulo"] =  "Editar Departamento";
                    $data["view"] = "editarDepartamento";
                    $data["departamento"] = $departamento->find($id_departamento);

SELECT *
FROM `funcionario`
WHERE `funcionario`.`id_funcionario` = '36'
SELECT *
FROM `departamento`
SELECT *
FROM `funcionario`
WHERE `funcionario`.`id_funcionario` = '29'
---

              $dadosFuncionario = $funcionario->find($id_funcionario);

               $data = [
                "nome" =>      $this->session->getFlashdata("nome"),
                "email" =>      $this->session->getFlashdata("email"),
                "sexo" =>      $this->session->getFlashdata("sexo"),
                "data_nascimento" =>      $this->session->getFlashdata("data_nascimento"),
                "inputDepartamento" =>      $this->session->getFlashdata("inputDepartamento"),
                "status" =>    $this->session->getFlashdata("status"),
                "msg" =>       $this->session->getFlashdata("msg"),
                "alertInfo" => $this->session->getFlashdata("alertInfo"),
                "erros" =>     $this->session->getFlashdata("erros"),
                "alert" =>     $this->session->getFlashdata("alert"),
                "titulo" => "Editar de Funcionários",
                "view" => "editarFuncionario",
                "todosDepartamentos" => $departamento->find(),
                "funcionario" => $funcionario->find($id_funcionario),
                "departamento" => $departamento->find($dadosFuncionario->departamento),
                ];

UPDATE `funcionario` SET `nome` = 'Eliasafe Duarte de Pinho', `sexo` = 'masculino', `data_nascimento` = '1997-05-14', `departamento` = '15', `status` = '0'
WHERE `funcionario`.`id_funcionario` IN ('36')
---
          public function EditarFuncionario(){

                if($this->request->getMethod() === "post"):

                        $funcionario = new \App\Models\FuncionarioModel();

                            $funcionario->find($this->request->getPost("id_funcionario"));
                            $funcionarioPost = $this->request->getPost();


                        if($funcionario->update($this->request->getPost("id_funcionario"), $funcionarioPost)):